Repository: AChep/keyguard-app
Catalog: appleUi/Sources/KeyguardUI/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hu, it, ja, ko, pt_br, pt_pt, ru, uk, zh_hans

# gpg_key_expiry_failed_title
source: Failed to update GPG key expiry
ar: فشل تحديث تاريخ انتهاء مفتاح GPG
de: GPG-Schlüsselablauf konnte nicht aktualisiert werden
es: Error al actualizar la caducidad de la clave GPG
fr: Échec de la mise à jour de l'expiration de la clé GPG
it: Impossibile aggiornare la scadenza della chiave GPG
ja: GPG キーの有効期限の更新に失敗しました
ko: GPG 키 만료를 업데이트하지 못했습니다.
pt_br: Falha ao atualizar a validade da chave GPG
pt_pt: Falha ao atualizar a data de expiração da chave GPG
ru: Не удалось обновить срок действия GPG-ключа
uk: Не вдалося оновити термін дії GPG-ключа
zh_hans: 更新 GPG 密钥过期时间失败

# gpg_key_expiry_invalid_message
source: Choose a valid future expiry date.
ar: اختر تاريخ انتهاء صالحًا في المستقبل.
de: Wählen Sie ein gültiges zukünftiges Ablaufdatum.
es: Elija una fecha de caducidad futura válida.
fr: Choisissez une date d'expiration future valide.
it: Scegli una data di scadenza futura valida.
ja: 有効な将来の有効期限を選択してください。
ko: 유효한 미래의 만료 날짜를 선택하세요.
pt_br: Escolha uma data de validade futura válida.
pt_pt: Escolha uma data de validade futura válida.
ru: Выберите корректную дату истечения срока действия в будущем.
uk: Виберіть коректну майбутню дату завершення терміну дії.
zh_hans: 请选择一个有效的未来过期日期。

# gpg_key_expiry_key_unreadable
source: The public key or its fingerprint could not be verified.
ar: تعذّر التحقق من المفتاح العام أو بصمته.
de: Der öffentliche Schlüssel oder sein Fingerabdruck konnte nicht überprüft werden.
es: No se pudo verificar la clave pública ni su huella digital.
fr: La clé publique ou son empreinte n'a pas pu être vérifiée.
it: Impossibile verificare la chiave pubblica o la sua impronta digitale.
ja: 公開鍵またはそのフィンガープリントを検証できませんでした。
ko: 공개 키 또는 그 핑거프린트를 확인할 수 없습니다.
pt_br: Não foi possível verificar a chave pública ou sua impressão digital.
pt_pt: Não foi possível verificar a chave pública nem a sua impressão digital.
ru: Не удалось проверить открытый ключ или его отпечаток.
uk: Не вдалося перевірити відкритий ключ або його відбиток.
zh_hans: 无法验证公钥或其指纹。

# gpg_key_expiry_missing_self_signature_message
source: This key cannot be renewed because its self-signature is missing, invalid, or rejected by security policy.
ar: لا يمكن تجديد هذا المفتاح لأن توقيعه الذاتي مفقود أو غير صالح أو مرفوض من سياسة الأمان.
fr: Cette clé ne peut pas être renouvelée parce que son auto-signature est manquante, invalide ou rejetée par la politique de sécurité.
pt_br: Esta chave não possui autoassinatura válida, portanto não pode ser renovada. Ele pode estar corrompido ou incompleto.
pt_pt: Esta chave não tem uma assinatura própria válida, pelo que não pode ser renovada. Pode estar corrompida ou incompleta.

# gpg_key_expiry_never
source: Never
ar: أبدًا
de: Nie
es: Nunca
fr: Jamais
it: Mai
ja: なし
ko: 만료 안 함
pt_br: Nunca
pt_pt: Nunca
ru: Никогда
uk: Ніколи
zh_hans: 永不过期

# gpg_key_expiry_no_components_message
source: Select at least one key component.
ar: حدّد مكوّن مفتاح واحدًا على الأقل.
de: Wählen Sie mindestens eine Schlüsselkomponente aus.
es: Seleccione al menos un componente de la clave.
fr: Sélectionnez au moins un composant de clé.
it: Seleziona almeno un componente della chiave.
ja: 少なくとも 1 つのキーコンポーネントを選択してください。
ko: 키 구성 요소를 하나 이상 선택하세요.
pt_br: Selecione pelo menos um componente da chave.
pt_pt: Selecione pelo menos um componente-chave.
ru: Выберите хотя бы один компонент ключа.
uk: Виберіть щонайменше один компонент ключа.
zh_hans: 请至少选择一个密钥组件。

# gpg_key_expiry_no_explicit_expiry
source: No explicit expiry
ar: لا يوجد تاريخ انتهاء صريح
de: Kein explizites Ablaufdatum
es: Sin caducidad explícita
fr: Aucune expiration explicite
it: Nessuna scadenza esplicita
ja: 明示的な有効期限なし
ko: 명시적 만료 없음
pt_br: Sem validade explícita
pt_pt: Sem data de expiração explícita
ru: Срок действия не задан
uk: Без явного терміну дії
zh_hans: 无明确的过期时间

# gpg_key_expiry_preset_custom
source: Custom date
ar: تاريخ مخصص
de: Benutzerdefiniertes Datum
es: Fecha personalizada
fr: Date personnalisée
it: Data personalizzata
ja: カスタム日付
ko: 사용자 지정 날짜
pt_br: Data personalizada
pt_pt: Data personalizada
ru: Пользовательская дата
uk: Користувацька дата
zh_hans: 自定义日期

# gpg_key_expiry_preset_five_years
source: Five years
ar: خمس سنوات
de: Fünf Jahre
es: Cinco años
fr: Cinq ans
it: Cinque anni
ja: 5 年
ko: 5년
pt_br: Cinco anos
pt_pt: Cinco anos
ru: Пять лет
uk: П'ять років
zh_hans: 五年

# gpg_key_expiry_preset_one_year
source: One year
ar: سنة واحدة
de: Ein Jahr
es: Un año
fr: Un an
it: Un anno
ja: 1 年
ko: 1년
pt_br: Um ano
pt_pt: Um ano
ru: Один год
uk: Один рік
zh_hans: 一年

# gpg_key_expiry_preset_two_years
source: Two years
ar: سنتان
de: Zwei Jahre
es: Dos años
fr: Deux ans
it: Due anni
ja: 2 年
ko: 2년
pt_br: Dois anos
pt_pt: Dois anos
ru: Два года
uk: Два роки
zh_hans: 两年

# gpg_key_expiry_primary
source: Primary key
ar: المفتاح الأساسي
de: Hauptschlüssel
es: Clave primaria
fr: Clé principale
it: Chiave primaria
ja: プライマリキー
ko: 기본 키
pt_br: Chave primária
pt_pt: Chave primária
ru: Основной ключ
uk: Основний ключ
zh_hans: 主密钥

# gpg_key_expiry_private_key_required
source: Import the private key to change its expiry.
ar: استورد المفتاح الخاص لتغيير تاريخ انتهاء صلاحيته.
de: Importieren Sie den privaten Schlüssel, um seinen Ablauf zu ändern.
es: Importe la clave privada para cambiar su caducidad.
fr: Importez la clé privée pour modifier son expiration.
it: Importa la chiave privata per modificarne la scadenza.
ja: 有効期限を変更するには秘密鍵をインポートしてください。
ko: 만료를 변경하려면 개인 키를 가져오세요.
pt_br: Importe a chave privada para alterar sua validade.
pt_pt: Importe a chave privada para alterar sua validade.
ru: Импортируйте секретный ключ, чтобы изменить его срок действия.
uk: Імпортуйте секретний ключ, щоб змінити його термін дії.
zh_hans: 导入私钥以修改其过期时间。

# gpg_key_expiry_revoked_message
source: A revoked key component cannot be renewed.
ar: لا يمكن تجديد مكوّن مفتاح مُبطَل.
de: Eine widerrufene Schlüsselkomponente kann nicht erneuert werden.
es: Un componente de clave revocado no se puede renovar.
fr: Un composant de clé révoqué ne peut pas être renouvelé.
it: Un componente di chiave revocato non può essere rinnovato.
ja: 失効したキーコンポーネントは更新できません。
ko: 폐기된 키 구성 요소는 갱신할 수 없습니다.
pt_br: Um componente de chave revogado não pode ser renovado.
pt_pt: Um componente chave revogado não pode ser renovado.
ru: Отозванный компонент ключа нельзя продлить.
uk: Відкликаний компонент ключа не можна поновити.
zh_hans: 无法更新已吊销的密钥组件。

# gpg_key_expiry_same_as_primary
source: Same as primary key (%1$@)
ar: مثل المفتاح الأساسي (%1$@)
de: Wie Hauptschlüssel (%1$@)
es: Igual que la clave primaria (%1$@)
fr: Identique à la clé principale (%1$@)
it: Come la chiave primaria (%1$@)
ja: プライマリキーと同じ (%1$@)
ko: 기본 키와 동일 (%1$@)
pt_br: Igual à chave primária %1$@
pt_pt: Igual à chave primária (%1$@)
ru: Как у основного ключа (%1$@)
uk: Так само, як основний ключ (%1$@)
zh_hans: 与主密钥相同 (%1$@)

# gpg_key_expiry_subkey
source: Subkey %1$@
ar: مفتاح فرعي %1$@
de: Unterschlüssel %1$@
es: Subclave %1$@
fr: Sous-clé %1$@
it: Sottochiave %1$@
ja: サブキー %1$@
ko: 하위 키 %1$@
pt_br: Subchave %1$@
pt_pt: Sub-chave %1$@
ru: Подключ %1$@
uk: Підключ %1$@
zh_hans: 子密钥 %1$@

# gpg_key_expiry_subkey_capabilities
source: Capabilities: %1$@. Current expiry: %2$@
ar: الإمكانات: %1$@. تاريخ الانتهاء الحالي: %2$@
de: Fähigkeiten: %1$@. Aktueller Ablauf: %2$@
es: Capacidades: %1$@. Caducidad actual: %2$@
fr: Capacités : %1$@. Expiration actuelle : %2$@
it: Capacità: %1$@. Scadenza attuale: %2$@
ja: 機能: %1$@。現在の有効期限: %2$@
ko: 기능: %1$@. 현재 만료: %2$@
pt_br: Capacidades: %1$@. Validade atual:%2$@
pt_pt: Capacidades: %1$@. Validade atual: %2$@
ru: Возможности: %1$@. Текущий срок действия: %2$@
uk: Можливості: %1$@. Поточний термін дії: %2$@
zh_hans: 功能：%1$@。当前过期时间：%2$@

# gpg_key_expiry_subkey_weak_self_signature
source: Signed with a weak algorithm (SHA-1). Renewing re-signs it with a modern one.
ar: موقّع بخوارزمية ضعيفة (SHA-1). التجديد يعيد توقيعه بخوارزمية حديثة.
fr: Signé avec un algorithme faible (SHA-1). Sera signé avec un algorithme plus récent lors du renouvellement.
pt_br: Assinado com um algoritmo fraco (SHA-1). Renovar o re-assina com um moderno.
pt_pt: Assinado com um algoritmo fraco (SHA-1). A renovação assina-o novamente com um algoritmo moderno.

# gpg_key_expiry_success_message
source: Save this item, then redistribute or upload its public key.
ar: احفظ هذا العنصر، ثم أعد توزيع مفتاحه العام أو ارفعه.
de: Speichern Sie dieses Element und verteilen Sie dann seinen öffentlichen Schlüssel neu oder laden Sie ihn hoch.
es: Guarde este elemento y luego redistribuya o suba su clave pública.
fr: Enregistrez cet élément, puis redistribuez ou téléversez sa clé publique.
it: Salva questo elemento, quindi ridistribuisci o carica la sua chiave pubblica.
ja: このアイテムを保存してから、公開鍵を再配布するかアップロードしてください。
ko: 이 항목을 저장한 다음, 공개 키를 재배포하거나 업로드하세요.
pt_br: Salve este item e, em seguida, redistribua ou envie sua chave pública.
pt_pt: Guarde este item e, em seguida, redistribua-o ou faça o upload da sua chave pública.
ru: Сохраните эту запись, затем распространите или загрузите её открытый ключ.
uk: Збережіть цей запис, а потім повторно поширте або завантажте його відкритий ключ.
zh_hans: 保存此条目，然后重新分发或上传其公钥。

# gpg_key_expiry_success_title
source: GPG key expiry updated
ar: تم تحديث تاريخ انتهاء مفتاح GPG
de: GPG-Schlüsselablauf aktualisiert
es: Caducidad de la clave GPG actualizada
fr: Expiration de la clé GPG mise à jour
it: Scadenza della chiave GPG aggiornata
ja: GPG キーの有効期限を更新しました
ko: GPG 키 만료가 업데이트되었습니다
pt_br: Validade da chave GPG atualizada
pt_pt: Chave GPG expirada atualizada
ru: Срок действия GPG-ключа обновлён
uk: Термін дії GPG-ключа оновлено
zh_hans: GPG 密钥过期时间已更新

# gpg_key_expiry_title
source: Expiry
ar: انتهاء الصلاحية
de: Ablauf
es: Caducidad
fr: Expiration
it: Scadenza
ja: 有効期限
ko: 만료
pt_br: Validade
pt_pt: Validade
ru: Срок действия
uk: Термін дії
zh_hans: 过期时间

# gpg_key_expiry_unavailable
source: Expiry editing is not supported on this platform.
ar: تحرير تاريخ الانتهاء غير مدعوم على هذه المنصة.
de: Die Bearbeitung des Ablaufs wird auf dieser Plattform nicht unterstützt.
es: La edición de la caducidad no es compatible con esta plataforma.
fr: La modification de l'expiration n'est pas prise en charge sur cette plateforme.
it: La modifica della scadenza non è supportata su questa piattaforma.
ja: このプラットフォームでは有効期限の編集はサポートされていません。
ko: 이 플랫폼에서는 만료 편집을 지원하지 않습니다.
pt_br: A edição de validade não é compatível nesta plataforma.
pt_pt: A edição de datas de expiração não é suportada nesta plataforma.
ru: Редактирование срока действия не поддерживается на этой платформе.
uk: Редагування терміну дії не підтримується на цій платформі.
zh_hans: 此平台不支持编辑过期时间。

# gpg_key_expiry_unknown
source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
fr: Inconnu
it: Sconosciuta
ja: 不明
ko: 알 수 없음
pt_br: Desconhecida
pt_pt: Desconhecido
ru: Неизвестно
uk: Невідомо
zh_hans: 未知

# gpg_key_expiry_unresolved_revocation_message
source: A designated revocation cannot be verified because the revoker's public key is unavailable. Import it and try again.
ar: لا يمكن التحقق من إبطال معيَّن لأن المفتاح العام للمُبطِل غير متوفر. استورده ثم حاول مرة أخرى.
de: Ein designierter Widerruf kann nicht überprüft werden, da der öffentliche Schlüssel des Widerrufenden nicht verfügbar ist. Importieren Sie ihn und versuchen Sie es erneut.
es: No se puede verificar una revocación designada porque la clave pública del revocador no está disponible. Impórtela e inténtelo de nuevo.
fr: Une révocation désignée ne peut pas être vérifiée car la clé publique du révocateur est indisponible. Importez-la et réessayez.
it: Una revoca designata non può essere verificata perché la chiave pubblica del revocante non è disponibile. Importala e riprova.
ja: 失効者の公開鍵が利用できないため、指定された失効を検証できません。その公開鍵をインポートしてから再度お試しください。
ko: 지정 폐기자의 공개 키를 사용할 수 없어 지정된 폐기를 확인할 수 없습니다. 해당 키를 가져와 다시 시도하세요.
pt_br: Não é possível verificar uma revogação designada porque a chave pública do revogador não está disponível. Importe-a e tente novamente.
pt_pt: Não foi possível verificar uma revogação designada porque a chave pública do revogador não está disponível. Importe-a e tente novamente.
ru: Не удалось проверить назначенный отзыв, так как открытый ключ отзывающего недоступен. Импортируйте его и повторите попытку.
uk: Не вдається перевірити призначене відкликання, оскільки відкритий ключ відкличника недоступний. Імпортуйте його та повторіть спробу.
zh_hans: 由于吊销者的公钥不可用，无法验证指定的吊销。请将其导入并重试。

# gpg_key_expiry_unsupported_signing_hash_message
source: This key can only be re-certified with an insecure digest algorithm. Migrate to a modern key instead.
ar: لا يمكن إعادة اعتماد هذا المفتاح إلا بخوارزمية تجزئة غير آمنة. انتقل إلى مفتاح حديث بدلاً من ذلك.
fr: Cette clé ne peut être recertifiée qu'avec un algorithme de hachage non sécurisé. Remplacez par une clé récente.
pt_br: Esta chave só pode ser recertificada com um algoritmo de resumo inseguro. Migre para uma chave moderna.
pt_pt: Esta chave só pode ser recertificada com um algoritmo de resumo inseguro. Migre para uma chave moderna.

# gpg_key_import_drop_here
source: Drop a file to import a GPG public or private key
ar: أفلت ملفًا لاستيراد مفتاح GPG عام أو خاص
de: Datei ablegen, um einen öffentlichen oder privaten GPG-Schlüssel zu importieren
es: Suelte un archivo para importar una clave pública o privada GPG
fr: Déposez un fichier pour importer une clé publique ou privée GPG
it: Trascina qui un file per importare una chiave pubblica o privata GPG
ja: ファイルをドロップして GPG の公開鍵または秘密鍵をインポート
ko: GPG 공개 키 또는 개인 키를 가져오려면 파일을 여기에 놓으세요
pt_br: Solte um arquivo para importar uma chave pública ou privada GPG
pt_pt: Arraste e largue um ficheiro para importar uma chave pública ou privada GPG
ru: Перетащите файл, чтобы импортировать открытый или секретный GPG-ключ
uk: Перетягніть файл, щоб імпортувати відкритий або секретний GPG-ключ
zh_hans: 拖放文件以导入 GPG 公钥或私钥

# gpg_key_import_error_empty
source: The GPG key file is empty.
ar: ملف مفتاح GPG فارغ.
de: Die GPG-Schlüsseldatei ist leer.
es: El archivo de clave GPG está vacío.
fr: Le fichier de clé GPG est vide.
it: Il file della chiave GPG è vuoto.
ja: GPG キーファイルが空です。
ko: GPG 키 파일이 비어 있습니다.
pt_br: O arquivo de chave GPG está vazio.
pt_pt: O ficheiro de chave GPG está vazio.
ru: Файл GPG-ключа пуст.
uk: Файл GPG-ключа порожній.
zh_hans: GPG 密钥文件为空。

# gpg_key_import_error_existing_malformed
source: The GPG key stored in this item is malformed and cannot be merged.
ar: مفتاح GPG المخزّن في هذا العنصر مشوّه ولا يمكن دمجه.
fr: La clé GPG stockée dans cet élément est malformée et ne peut pas être fusionnée.
pt_br: A chave GPG armazenada neste item está malformada e não pode ser mesclada.
pt_pt: A chave GPG guardada neste item está mal formada e não pode ser fundida.

# gpg_key_import_error_invalid_passphrase
source: The GPG key passphrase is invalid.
ar: عبارة مرور مفتاح GPG غير صالحة.
de: Die GPG-Schlüssel-Passphrase ist ungültig.
es: La contraseña de clave GPG no es válida.
fr: La phrase de passe de la clé GPG est invalide.
it: La passphrase della chiave GPG non è valida.
ja: GPG キーのパスフレーズが無効です。
ko: 잘못된 GPG 키 비밀 문구입니다.
pt_br: A senha da chave GPG é inválida.
pt_pt: A palavra-passe da chave GPG é inválida.
ru: Парольная фраза GPG-ключа недействительна.
uk: Парольна фраза GPG-ключа недійсна.
zh_hans: GPG 密钥密码无效。

# gpg_key_import_error_key_changed
source: The GPG key changed while the import was in progress. Try importing it again.
ar: تغيّر مفتاح GPG أثناء الاستيراد. حاول استيراده مرة أخرى.
de: Der GPG-Schlüssel hat sich während des Imports geändert. Versuchen Sie, ihn erneut zu importieren.
es: La clave GPG cambió mientras la importación estaba en curso. Intente importarla de nuevo.
fr: La clé GPG a changé pendant l'importation. Essayez de l'importer à nouveau.
it: La chiave GPG è cambiata durante l'importazione. Prova a importarla di nuovo.
ja: インポート中に GPG キーが変更されました。もう一度インポートしてください。
ko: 가져오는 중에 GPG 키가 변경되었습니다. 다시 가져와 보세요.
pt_br: A chave GPG foi alterada durante a importação. Tente importá-la novamente.
pt_pt: A chave GPG mudou enquanto a importação estava em andamento. Tente importá-la novamente.
ru: GPG-ключ изменился во время импорта. Попробуйте импортировать его снова.
uk: GPG-ключ змінився під час імпорту. Спробуйте імпортувати його ще раз.
zh_hans: 导入过程中 GPG 密钥发生了变化。请尝试重新导入。

# gpg_key_import_error_malformed_key
source: The GPG key file is malformed.
ar: ملف مفتاح GPG مشوّه.
de: Die GPG-Schlüsseldatei ist fehlerhaft.
es: El archivo de clave GPG está mal formado.
fr: Le fichier de clé GPG est malformé.
it: Il file della chiave GPG è danneggiato.
ja: GPG キーファイルの形式が正しくありません。
ko: 잘못된 GPG 키 파일입니다.
pt_br: O arquivo de chave GPG está malformado.
pt_pt: O ficheiro de chave GPG está malformado.
ru: Файл GPG-ключа повреждён.
uk: Файл GPG-ключа має хибний формат.
zh_hans: GPG 密钥文件格式损坏。

# gpg_key_import_error_mismatched_key
source: The imported key does not match the GPG key in this item.
ar: المفتاح المستورد لا يطابق مفتاح GPG في هذا العنصر.
fr: La clé importée ne correspond pas à la clé GPG de cet élément.
pt_br: A chave importada não corresponde à chave GPG neste item.
pt_pt: A chave importada não corresponde à chave GPG deste item.

# gpg_key_import_error_multiple_keys
source: The file contains more than one GPG key. Export and import the keys one at a time.
ar: يحتوي الملف على أكثر من مفتاح GPG. صدّر المفاتيح واستوردها واحدًا تلو الآخر.
fr: Le fichier contient plus d'une clé GPG. Exporter et importer les clés une à la fois.
pt_br: O arquivo contém mais de uma chave GPG. Exporte e importe as chaves, uma de cada vez.
pt_pt: O ficheiro contém mais do que uma chave GPG. Exporte e importe as chaves uma de cada vez.

# gpg_key_import_error_passphrase_required
source: A passphrase is required to unlock this GPG key.
ar: مطلوب عبارة مرور لفتح مفتاح GPG هذا.
de: Zum Entsperren dieses GPG-Schlüssels ist eine Passphrase erforderlich.
es: Se requiere una contraseña para desbloquear esta clave GPG.
fr: Une phrase de passe est requise pour déverrouiller cette clé GPG.
it: È necessaria una passphrase per sbloccare questa chiave GPG.
ja: この GPG キーのロックを解除するにはパスフレーズが必要です。
ko: 이 GPG 키를 잠금 해제하려면 비밀 문구가 필요합니다.
pt_br: Uma senha é necessária para desbloquear esta chave GPG.
pt_pt: É necessária uma palavra-passe para desbloquear esta chave GPG.
ru: Для разблокировки этого GPG-ключа требуется парольная фраза.
uk: Для розблокування цього GPG-ключа потрібна парольна фраза.
zh_hans: 需要密码才能解锁此 GPG 密钥。

# gpg_key_import_error_read
source: Unable to read the selected file.
ar: تعذّرت قراءة الملف المحدد.
de: Die ausgewählte Datei konnte nicht gelesen werden.
es: No es posible leer el archivo seleccionado.
fr: Impossible de lire le fichier sélectionné.
it: Impossibile leggere il file selezionato.
ja: 選択したファイルを読み取れません。
ko: 선택한 파일을 읽지 못했습니다.
pt_br: Não é possível ler o arquivo selecionado.
pt_pt: Não foi possível ler o ficheiro selecionado.
ru: Не удалось прочитать выбранный файл.
uk: Не вдалося прочитати вибраний файл.
zh_hans: 无法读取所选文件。

# gpg_key_import_error_reconcile
source: The GPG key could not be safely merged.
ar: تعذّر دمج مفتاح GPG بأمان.
fr: La clé GPG n'a pas pu être fusionnée en toute sécurité.
pt_br: A chave GPG não pôde ser mesclada com segurança.
pt_pt: A chave GPG não pôde ser fundida em segurança.

# gpg_key_import_error_resource_limit
source: The GPG key is too large or complex to import.
ar: مفتاح GPG كبير جدًا أو معقّد جدًا لاستيراده.
fr: La clé GPG est trop grande ou complexe à importer.
pt_br: A chave GPG é muito grande ou complexa para importar.
pt_pt: A chave GPG é demasiado grande ou complexa para ser importada.

# gpg_key_import_error_secret_conflict
source: The imported secret key material conflicts with the secret key stored in this item.
ar: تتعارض مادة المفتاح السري المستوردة مع المفتاح السري المخزّن في هذا العنصر.
fr: La clé secrète importée entre en conflit avec la clé secrète stockée dans cet élément.
pt_br: O material da chave secreta importado entra em conflito com a chave secreta armazenada neste item.
pt_pt: O material da chave secreta importada entra em conflito com a chave secreta armazenada neste item.

# gpg_key_import_error_unsupported_format
source: Unsupported GPG key format.
ar: صيغة مفتاح GPG غير مدعومة.
de: Nicht unterstütztes GPG-Schlüsselformat.
es: Formato de clave GPG no soportado.
fr: Format de clé GPG non pris en charge.
it: Formato della chiave GPG non supportato.
ja: サポートされていない GPG キー形式です。
ko: 지원하지 않는 GPG 키 형식입니다.
pt_br: Formato de chave GPG não suportado.
pt_pt: Formato de chave GPG não suportado.
ru: Неподдерживаемый формат GPG-ключа.
uk: Непідтримуваний формат GPG-ключа.
zh_hans: 不支持的 GPG 密钥格式。

# gpg_key_import_error_unsupported_platform
source: GPG key import is not supported on this platform.
ar: استيراد مفاتيح GPG غير مدعوم على هذه المنصة.
de: Der Import von GPG-Schlüsseln wird auf dieser Plattform nicht unterstützt.
es: La importación de claves GPG no es compatible con esta plataforma.
fr: L'importation de clés GPG n'est pas prise en charge sur cette plateforme.
it: L'importazione delle chiavi GPG non è supportata su questa piattaforma.
ja: このプラットフォームでは GPG キーのインポートはサポートされていません。
ko: 이 플랫폼에서는 GPG 키 가져오기를 지원하지 않습니다.
pt_br: A importação de chave GPG não é suportada nesta plataforma.
pt_pt: A importação de chaves GPG não é suportada nesta plataforma.
ru: Импорт GPG-ключа не поддерживается на этой платформе.
uk: Імпорт GPG-ключа не підтримується на цій платформі.
zh_hans: 此平台不支持导入 GPG 密钥。

# gpg_key_import_failed_title
source: Failed to import GPG key
ar: فشل استيراد مفتاح GPG
de: GPG-Schlüssel konnte nicht importiert werden
es: Error al importar la clave GPG
fr: Échec de l'importation de la clé GPG
it: Impossibile importare la chiave GPG
ja: GPG キーのインポートに失敗しました
ko: GPG 키를 가져오지 못했습니다.
pt_br: Falha ao importar a chave GPG
pt_pt: Falha ao importar a chave GPG
ru: Не удалось импортировать GPG-ключ
uk: Не вдалося імпортувати GPG-ключ
zh_hans: 导入 GPG 密钥失败

# gpg_key_import_passphrase_dialog_message
source: This %1$@ private key is encrypted. Keyguard will store it without the key passphrase after import.
ar: هذا المفتاح الخاص %1$@ مشفّر. سيخزّنه Keyguard دون عبارة مرور المفتاح بعد الاستيراد.
de: Dieser private %1$@-Schlüssel ist verschlüsselt. Keyguard speichert ihn nach dem Import ohne die Schlüssel-Passphrase.
es: Esta clave privada %1$@ está cifrada. Keyguard la almacenará sin la contraseña de la clave tras la importación.
fr: Cette clé privée %1$@ est chiffrée. Keyguard la stockera sans la phrase de passe après l'importation.
it: Questa chiave privata %1$@ è crittografata. Keyguard la memorizzerà senza la passphrase dopo l'importazione.
ja: この %1$@ 秘密鍵は暗号化されています。Keyguard はインポート後、キーのパスフレーズなしで保存します。
ko: 이 %1$@ 개인 키는 암호화되어 있습니다. Keyguard는 가져온 후 키 비밀 문구 없이 저장합니다.
pt_br: Esta chave privada %1$@ é criptografada. O Keyguard irá armazená-lo sem a senha da chave após a importação.
pt_pt: Esta chave privada %1$@ está encriptada. O Keyguard irá armazená-la sem a palavra-passe da chave após a importação.
ru: Этот секретный ключ %1$@ зашифрован. После импорта Keyguard сохранит его без парольной фразы.
uk: Цей секретний ключ %1$@ зашифровано. Keyguard збереже його без парольної фрази ключа після імпорту.
zh_hans: 此 %1$@ 私钥已加密。导入后，Keyguard 将在不保存密钥密码的情况下存储该私钥。

# gpg_key_import_passphrase_dialog_title
source: Enter GPG key passphrase
ar: أدخل عبارة مرور مفتاح GPG
de: Passphrase für GPG-Schlüssel eingeben
es: Introduzca contraseña de clave GPG
fr: Saisir la phrase de passe de la clé GPG
it: Inserisci la passphrase della chiave GPG
ja: GPG キーのパスフレーズを入力
ko: GPG 키 비밀 문구 입력
pt_br: Insira a senha da chave GPG
pt_pt: Introduza a senha da chave GPG
ru: Введите парольную фразу GPG-ключа
uk: Введіть парольну фразу GPG-ключа
zh_hans: 输入 GPG 密钥密码
